{
    "$schema": "https://schema.management.azure.com/schemas/2019-04-01/deploymentTemplate.json#",
    "contentVersion": "1.0.0.0",
    "parameters": {
        "location": {
            "type": "string",
            "metadata": {
                "description": "Location for all resources."
            }
        }
    },
    "resources": [
        {
            "type": "Microsoft.SecurityInsights/alertRules",
            "apiVersion": "2019-01-01-preview",
            "location": "[parameters('location')]",
            "name": "38a495bb-de04-47a2-ab1b-bef7c4ffc0ba",
            "kind": "Scheduled",
            "properties": {
                "alertRuleTemplateName": null,
                "description": "Basic internal rule to detect binary named sandcat.exe connecting to an IP address",
                "displayName": "Sandcat Payload",
                "enabled": true,
                "incidentConfiguration": {
                "createIncident": true,
                "groupingConfiguration": {
                    "enabled": false,
                    "entitiesMatchingMethod": "All",
                    "groupByEntities": [],
                    "lookbackDuration": "PT5H",
                    "reopenClosedIncident": false
                }
                },
                "query": "SecurityEvent\n| where EventID == \"4688\" and CommandLine contains \"sandcat.exe\"",
                "queryFrequency": "PT5M",
                "queryPeriod": "PT5M",
                "queryResultsAggregationSettings": {
                "aggregationKind": "SingleAlert"
                },
                "severity": "High",
                "suppressionDuration": "PT5H",
                "suppressionEnabled": false,
                "tactics": [
                    "CommandAndControl"
                ],
                "triggerOperator": "Equal",
                "triggerThreshold": 1
            }
        }
    ]
}